       01 UC01.                                                         00010001
         02 UC01-02 PIC X.                                              00020001
