       IDENTIFICATION DIVISION.
       PROGRAM-ID. HelloWorld.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 SOME-THING PIC X(8).
       LINKAGE SECTION.

       PROCEDURE DIVISION.
           DISPLAY "Hello World".
           DISPLAY SOME-THING.
           STOP RUN.
